perf/baseline.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-baseline"

  pool: 25

  phases:
    - name: Warmup
      duration: 30
      arrivalRate: 1
    - name: Baseline
      duration: 120
      arrivalRate: 2
    

scenarios:
  - name: Baseline Performance
    weight: 100
    flow:
      - get:
          url: '/rates'
      - think: 1
      - get:
          url: '/accounts'
      - think: 2
      - get:
          url: '/log'